{"pages":[],"posts":[{"title":"About me","text":"My name is Chun Hua LuMy major is applied data science, and my bachelor degree is in computer scienceAbout myself I love to draw and write blog in my free time. I have experience in data science, computer networking, web development. Nice to meet you. programming languages I use python (pandas, numpy, matplotlib,sklearn) C++ web technology frontend (html,css,javascript) backend (node.js) special library (simpleWebrtc, socket.io) git matlab C# (Unity) Java (processing) major courses ongoing : INF 551 Foundations of Data Management :Firebase, JSON, Hadoop, Spark, SQL, NoSQL, Amazon AWS INF 552 Machine Learning for Data : Use python to implement and analyze Machine Learning algorithms","link":"/2019/10/01/About-me/"},{"title":"2019/9/27","text":"I draw in my free time","link":"/2019/09/27/2019-9-27/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/09/27/hello-world/"},{"title":"lintcode-615","text":"description : lintcode 615 topology sorting dag (directed acyclic graph) =&gt; G = ( V, E ) linear ordering no cycle topology sort (G) store neighbor in dictionary edge compute indegree find node where indegree == 0 &amp; add to queue use bfs ( add 1 to count visited node, and decrease indegree by 1 ) if indegree of beighbor node reduce to 0 add into queue solution : 615 solution G = (V, E)time analysis: O (V+E)","link":"/2019/09/30/lintcode-615/"}],"tags":[{"name":"AboutMe","slug":"AboutMe","link":"/tags/AboutMe/"},{"name":"drawing","slug":"drawing","link":"/tags/drawing/"},{"name":"lintcode","slug":"lintcode","link":"/tags/lintcode/"},{"name":"python","slug":"python","link":"/tags/python/"}],"categories":[]}